#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a3paper]
#+LATEX_HEADER: \usepackage{kotex}
#+LATEX_HEADER: \usepackage{CJKutf8}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage[scale=0.75,twoside,bindingoffset=5mm]{geometry}
#+LATEX_HEADER: \usepackage[onehalfspacing]{setspace}
#+LATEX_HEADER: \usepackage{longtable}
#+Author:전파고양이
#+OPTIONS: ^:{} toc:t
#+hugo_base_dir: ~/blog
#+title: nodejs-express 환경 설정하기 


* config json으로 환경 변수 읽어오기

#+begin_src sh
npm i config
#+end_src

#+begin_src sh
curl localhost:4000
#+end_src

#+RESULTS:
: hello word

